import UIKit


let 입력값 = [5, 10, 2, 73, 15, 6, 66, 3]

/*:
### 트리
 * 나무를 거꾸로 뒤집어 놓은 모양
 * 탐색을 위한 자료 구조
 * 뿌리(Root Node), 가지(Edge), 잎(node)로 구성
*/

/*:
![트리 구조](./Tree_1.png)
![트리 차수](./Tree_2.png)
*/


/*:
### 이진 트리
 * 자식 노드가 최대 두 개인 노드들로 구성된 트리입니다.
 */

/*:
![트리 구조](./Tree_3.png)
![트리 차수](./Tree_4.png)
![트리 차수](./Tree_5.png)
![트리 차수](./Tree_6.png)
*/

/*:
### 탐색을 위한 이진트리
 * 왼쪽 자식은 나보다 작고, 오른쪽 자식은 나보다 크다는 특징이 있다.
 */

/*:
![트리 구조](./Tree_7.png)
![트리 구조](./Tree_8.png)
![트리 구조](./Tree_9.png)
![트리 구조](./Tree_10.png)
*/



/*:
### 그래프
 * 그래프틑 순환할 수 있다는 점
 
 ![트리 구조](./Graph_1.png)
 */

/*:
### BFS (넓이 우선 탐색)
 
 ![트리 구조](./Graph_2.png)
 */

/*:
### DFS (깊이 우선 탐색)
 
 ![트리 구조](./Graph_3.png)
 */
