import Foundation

/*:
 ### 암호 해독
 * 모든 알고리즘을 해독할 수 있는 알고리즘 7 원석를 보유한 알고리즘 제왕 **파이**와 **썬**은 죽기 전, 이 보물에 '암호'를 걸어 세계 어딘가에 묻어놨다고 공표하였다. 그가 남긴 문자는 아래와 같다.
 
 * 문제
 
 ```python
 섬으로 향하라!

 '   + -- + - + -   '
 '   + --- + - +   '
 '   + -- + - + -   '
 '   + - + - + - +   '

 해(**1**)와 달(**0**),
 Code의 세상 안으로!(**En-Coding**)
 ```
 
 
 * 인코딩 : 문자나 기호들의 집합을 컴퓨터에서 표현하는 방법.
  ex) ASCII
 
 */

let text = ["+ -- + - + -",
            "+ --- + - +",
            "+ -- + - + -",
            "+ - + - + - +"]

text.


